#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.genericRG: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG]
azurerm_public_ip.winPublicIP: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/publicIPAddresses/DemoWindows]
azurerm_network_security_group.rdpNSG: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/networkSecurityGroups/DemoRDPSG]
azurerm_virtual_network.genericVNet: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/virtualNetworks/Demo-Main]
azurerm_public_ip.devRHPublicIP: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/publicIPAddresses/DemoDevRHPublicIP]
azurerm_storage_account.genericSA: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Storage/storageAccounts/demodevenv]
azurerm_network_security_group.sshNSG: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/networkSecurityGroups/DemoSSHSG]
azurerm_subnet.app: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/virtualNetworks/Demo-Main/subnets/demo-dev-app]
azurerm_subnet.main: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/virtualNetworks/Demo-Main/subnets/demo-dev-main]
azurerm_network_interface.devRHNI: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/networkInterfaces/DemoDevRHNIC]
azurerm_network_interface.winNI: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/networkInterfaces/DemoWindows]
azurerm_network_interface_security_group_association.devRHSG: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/networkInterfaces/DemoDevRHNIC|/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/networkSecurityGroups/DemoSSHSG]
azurerm_network_interface_security_group_association.winSG: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/networkInterfaces/DemoWindows|/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Network/networkSecurityGroups/DemoRDPSG]
azurerm_storage_share.genericFileShare: Refreshing state... [id=https://demodevenv.file.core.windows.net/devsharefolder]
azurerm_linux_virtual_machine.mainDevVM: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Compute/virtualMachines/DemoDevRH]
azurerm_windows_virtual_machine.winVM: Refreshing state... [id=/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Compute/virtualMachines/DemoWindows]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.mainDevVM must be replaced
-/+ resource "azurerm_linux_virtual_machine" "mainDevVM" {
      - availability_set_id             = "" -> null
      ~ computer_name                   = "DemoDevRH" -> (known after apply)
      - dedicated_host_id               = "" -> null
      - encryption_at_host_enabled      = false -> null
      - eviction_policy                 = "" -> null
      ~ id                              = "/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Compute/virtualMachines/DemoDevRH" -> (known after apply)
      - license_type                    = "" -> null
        name                            = "DemoDevRH"
      ~ private_ip_address              = "10.60.0.20" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.60.0.20",
        ] -> (known after apply)
      - proximity_placement_group_id    = "" -> null
      ~ public_ip_address               = "52.167.204.163" -> (known after apply)
      ~ public_ip_addresses             = [
          - "52.167.204.163",
        ] -> (known after apply)
      - source_image_id                 = "" -> null
        tags                            = {
            "BillingCode" = "Internal"
            "Customer"    = "Demo"
            "Environment" = "Development"
            "POC"         = "Marcelo Zambrana V."
            "Project"     = "Demo IC"
        }
      ~ virtual_machine_id              = "14bd55da-1d04-4337-a250-1f55aa798b46" -> (known after apply)
      - virtual_machine_scale_set_id    = "" -> null
      ~ zone                            = "" -> (known after apply)
        # (12 unchanged attributes hidden)

      ~ admin_ssh_key { # forces replacement
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }


      ~ os_disk {
          ~ disk_size_gb              = 64 -> (known after apply)
            name                      = "DemoDevRHOSDisk"
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_storage_share.genericFileShare will be updated in-place
  ~ resource "azurerm_storage_share" "genericFileShare" {
        id                   = "https://demodevenv.file.core.windows.net/devsharefolder"
        name                 = "devsharefolder"
      ~ quota                = 100 -> 50
        # (4 unchanged attributes hidden)
    }

  # azurerm_windows_virtual_machine.winVM must be replaced
-/+ resource "azurerm_windows_virtual_machine" "winVM" {
      ~ admin_password               = (sensitive value) # forces replacement
      - availability_set_id          = "" -> null
      ~ computer_name                = "DemoWindows" -> (known after apply)
      - dedicated_host_id            = "" -> null
      - encryption_at_host_enabled   = false -> null
      - eviction_policy              = "" -> null
      ~ id                           = "/subscriptions/3a0ed40a-f9cc-48b3-81c6-4cff5a9741d8/resourceGroups/DemogenericRG/providers/Microsoft.Compute/virtualMachines/DemoWindows" -> (known after apply)
      - license_type                 = "" -> null
        name                         = "DemoWindows"
      ~ private_ip_address           = "10.60.0.4" -> (known after apply)
      ~ private_ip_addresses         = [
          - "10.60.0.4",
        ] -> (known after apply)
      - proximity_placement_group_id = "" -> null
      ~ public_ip_address            = "20.98.248.177" -> (known after apply)
      ~ public_ip_addresses          = [
          - "20.98.248.177",
        ] -> (known after apply)
      - source_image_id              = "" -> null
        tags                         = {
            "BillingCode" = "Internal"
            "Customer"    = "Demo"
            "Environment" = "Development"
            "POC"         = "Marcelo Zambrana V."
            "Project"     = "Demo IC"
        }
      - timezone                     = "" -> null
      ~ virtual_machine_id           = "df410ffa-fd9d-451c-8c3c-2d8f4ca309e2" -> (known after apply)
      - virtual_machine_scale_set_id = "" -> null
      ~ zone                         = "" -> (known after apply)
        # (13 unchanged attributes hidden)


      ~ os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
            name                      = "DemoWindowsOSDisk"
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ sshAccess = <<-EOT
          ssh demoAdmin@52.167.204.163 -i ~/.ssh/vm_ssh
    EOT

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @Chambras, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*